(*
строгое соответствие типов(никакого приведения типов)
в цикле фор увеличение переменной строго на 1
строка формата в scanf и printf должна быть правильной
тело функции определяется при объявлении
разрешён толлько один инклуд #include <stdio.h> из которого доступны только scanf и printf
функция main определяется последней
аргументы main, а так же её тип и возвращаемое значение игнорируются
запрещён преждевременный выход из функции
запрещён switch
запрещены побитовые операции, в том числе и сдвиги
запрещены указатели
printf обязаткельно выводит перевод строки
*)
function sqr(pull : Int64; x, b : ShortInt; z : Comp) : Int64;
function sqr2(pull : Int64; x, b : ShortInt; z : Comp) : Int64;
function main() : LongInt;
